

package Homework_2;
//Напишите программу вывода всех четных чисел от 2 до 100 включительно
public class Lesson_6 {
    public static void main(String[] args) {
        for (int i = 2; i <= 100; i += 2) {
            System.out.println(i);
        }
    }
}

